
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// 01.05.25 Создание кнопки пересчета данных таблицы с учетом скидки	
	Если Элементы.Найти("КнопкаПересчитатьТаблицу") = Неопределено Тогда
		СоздатьКнопкуПересчета(ЭтотОбъект);	
	КонецЕсли;

 ДобавитьПолеСогласованнаяСкидка();
		
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере	
Процедура ДобавитьПолеСогласованнаяСкидка();
	ПолеВвода = Элементы.Добавить("СогласованнаяСкидка",Тип("ПолеФормы"),Элементы.ГруппаШапкаЛево);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие ("ПриИзменении","ОбработчикИзмененияПоля");  
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
// Предыдущий код	
//	КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
//	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
// Доработанный Код (если необходимо, чтобы учитывались обе скидки - и в табличной части, и в реквизите)
	КоэффициентСкидки = 1 - (Объект.СогласованнаяСкидка + ТекущиеДанные.Скидка)/100;
	
	Если КоэффициентСкидки < 0 Тогда 
		КоэффициентСкидки = 0; 
		//@skip-check use-non-recommended-method
		Сообщить(СтрШаблон("Превышение скидки - %1",ТекущиеДанные.Номенклатура));
	КонецЕсли;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки; 
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры
#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


// 01.05.25 Создание кнопки пересчета данных таблицы с учетом скидки
&НаСервере
Процедура СоздатьКнопкуПересчета(Форма);
	КомандаПересчета = Команды.Добавить("ПересчитатьТаблицу"); 
	КомандаПересчета.Заголовок = "Пересчитать таблицу";  
	КомандаПересчета.Действие = "КомандаПересчитать";
	КнопкаКоманды = Элементы.Добавить("КнопкаПересчитатьТаблицу",Тип("КнопкаФормы"),Элементы.ГруппаШапкаЛево);
	КнопкаКоманды.ИмяКоманды = "ПересчитатьТаблицу";
	КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
КонецПроцедуры   

//@skip-check module-unused-method
&НаКлиенте
Процедура КомандаПересчитать (Форма)
	РассчитатьСуммуТоваровУслуг();	
КонецПроцедуры       
&НаКлиенте
Процедура РассчитатьСуммуТоваровУслуг()
	Для Каждого СтрокаТовары из Объект.Товары Цикл
		РассчитатьСуммуСтроки(СтрокаТовары);  
	КонецЦикла;
	Для Каждого СтрокаУслуги из Объект.Услуги Цикл
		РассчитатьСуммуСтроки(СтрокаУслуги);     
	КонецЦикла;	 
	РассчитатьСуммуДокумента();	
КонецПроцедуры   

// 01.05.2025 Добавление вопроса при изменении значения скидки в элементе "Согласованная скидка" 
&НаКлиенте
Процедура  ОбработчикИзмененияПоля (Элемент) Экспорт
	ТоварыКоличество = Объект.Товары.Количество();   
	УслугиКоличество = Объект.Услуги.Количество();	
	Если ТоварыКоличество = 0 И УслугиКоличество = 0 Тогда
		Возврат;
	КонецЕсли; 	
	ЗадатьВопросПользователюАсинх(); 
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗадатьВопросПользователюАсинх() Экспорт   
	Ответ = ВопросАсинх("Изменен процент скидки. Пересчитать таблицы товаров и услуг?", РежимДиалогаВопрос.ДаНет);
	ОтветНаВопрос = Ждать Ответ;
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда   
		РассчитатьСуммуТоваровУслуг();
	КонецЕсли;
	 
КонецПроцедуры 

#КонецОбласти

